data/agiliumlabs/toSignSimple.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
	<soap:Header><smev:Header xmlns:smev="http://smev.gosuslugi.ru/rev120315"><smev:NodeId>1</smev:NodeId><smev:MessageId>12311111-1111-1000-01</smev:MessageId><smev:TimeStamp>2012-02-02T00:02:02</smev:TimeStamp><smev:MessageClass>REQUEST</smev:MessageClass></smev:Header>
	</soap:Header>
	<soap:Body wsu:Id="body"><ns:PutDocument xmlns="http://www.w3.org/2004/08/xop/include" xmlns:ns="http://www.red-soft.biz/ncore/dx/ws/smev-243" xmlns:smev="http://smev.gosuslugi.ru/rev120315"><smev:Message><smev:Sender><smev:Code>ADLR01481</smev:Code><smev:Name>innovativeWork</smev:Name></smev:Sender><smev:Recipient><smev:Code>ADLR01481</smev:Code><smev:Name>The security provider should be certified, that is why there is no much choice, Crypto Pro probably is the only one available. Bouncycastle implements</smev:Name></smev:Recipient><smev:TypeCode>GSRV</smev:TypeCode><smev:Status>REQUEST</smev:Status><smev:Date>2012-02-02T02:02:02</smev:Date><smev:ExchangeType>2</smev:ExchangeType><smev:ServiceCode>SERVICE001</smev:ServiceCode><smev:CaseNumber>CASE001</smev:CaseNumber><smev:TestMsg>SMEVTEST</smev:TestMsg></smev:Message><smev:MessageData><smev:AppData xmlns:smev="http://smev.gosuslugi.ru/rev120315" Id="appDataBody"><tns:IQueryBph xmlns:tns="http://www.red-soft.biz/schemas/shgate/common/2011/0.5" xmlns:ws="http://www.red-soft.biz/ncore/dx/ws/smev-243" Id="appDataContent"><tns:Area>Area52</tns:Area><tns:BuildingName>Название строения</tns:BuildingName><tns:CadastraNumber>1122334455667788</tns:CadastraNumber><tns:AddressZemUchBph><tns:City>innovativeWork</tns:City><tns:House>12</tns:House><tns:Street>Стаханова</tns:Street><tns:Region>Центральный</tns:Region><tns:Locality>Липецк</tns:Locality><tns:Building>1</tns:Building><tns:District>24</tns:District><tns:Apartment>47</tns:Apartment><tns:Structure>2</tns:Structure></tns:AddressZemUchBph></tns:IQueryBph></smev:AppData></smev:MessageData></ns:PutDocument></soap:Body></soap:Envelope>